# 11. Даны три числа a, b, c. Значение наибольшего из них присвоить переменной d.

a = int(input("Введите число a: "))
b = int(input("Введите число b: "))
c = int(input("Введите число c: "))
d = max(a, b, c)

print("Наибольшее число:", d)
